Configuration/InformationRegisters/бит_ум_ДокументыИР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ум_ДокументыИР</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопПоле</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТерриторияДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГосударственныйОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ум_ГосударственныеОрганы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопПоле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ум_ВидыДокументовИР</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Configuration/CommonModules/бит_ум_УчетМигрантовСобытия/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Учет мигрантов".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Если физическое лицо является иностранцем и у него не заполнены паспортные данные
// в регистре сведений "Документы иностранных работников", то заполним их из регистра
// "Документы физических лиц".
//
// Параметры:
//   Источник - РегистрСведенийНаборЗаписей.ДокументыФизическихЛиц - источник события.
//   Отказ - Булево - Признак отказа от записи набора в базу данных.
//		Значение по умолчанию: Ложь. 
//   Замещение - Булево - Режим записи набора.
//		Истина - запись осуществляется с заменой существующих в базе данных записей набора.
//		Ложь - запись осуществляется с "дописыванием" текущего набора записей. 
//
Процедура ДокументыФизическихЛицПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;      
	
	Если НЕ ПравоДоступа("Чтение", Метаданные.Константы.бит_ум_ПереноситьДанныеПаспортаИзДокументовФизЛиц) 
		ИЛИ НЕ бит_ум_УчетМигрантовПовтИсп.ПолучитьКонстантуИзНастроек("ПереноситьДанныеПаспортаИзДокументовФизЛиц") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПравоДоступа("Изменение", Метаданные.РегистрыСведений.бит_ум_ДокументыИР)
		ИЛИ НЕ ПравоДоступа("Чтение", Метаданные.РегистрыСведений.бит_ум_ДокументыИР) Тогда
		Возврат;
	КонецЕсли;
		
	Для Каждого Движение Из Источник Цикл
		
		Если НЕ ЗначениеЗаполнено(Движение.Физлицо) ИЛИ НЕ ЗначениеЗаполнено(Движение.Номер) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Движение.ВидДокумента, "КодМВД") <> "10" Тогда
			Продолжить;
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.бит_ум_ДокументыИР.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = Движение.Период;
		МенеджерЗаписи.Физлицо = Движение.Физлицо;
		МенеджерЗаписи.ВидДокумента =
			ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.бит_ум_ВидыДокументовИР.ПаспортИностранногоГражданина");
		МенеджерЗаписи.Серия = Движение.Серия; 
		МенеджерЗаписи.Номер = Движение.Номер;
		МенеджерЗаписи.ДатаВыдачи = Движение.ДатаВыдачи;
		МенеджерЗаписи.СрокДействия = Движение.СрокДействия;
		МенеджерЗаписи.ГосударственныйОрган =
			бит_ум_УчетМигрантовСервер.НайтиГосударственныйОрганПоНаименованию(Движение.КемВыдан);
		
		Попытка
			МенеджерЗаписи.Записать();
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
